---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimLeaderShoulderLength
source: html/4fac3df0-6bb4-4344-9d47-47e5821af1d1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimLeaderShoulderLength Property

"Shoulder Length"

## Syntax (C#)
```csharp
public static ForgeTypeId DimLeaderShoulderLength { get; }
```